
/*
******************************************************************************
本文件用于存放全局变量


******************************************************************************
*/


#include "main.h"
#include "global.h"



/****************存放main中的全局变量*****************/















/****************存放uart中的全局变量*****************/
uint8_t RxData[MAX];          //上位机原始数据帧存放处

uint8_t value;     //上位机发来的字节
uint16_t volatile uart_index;    //读到位
uint8_t volatile ifrxstart;
uint8_t volatile rxcplt_flag = 0;      //数据读完标志位









/****************存放readdata中的全局变量*****************/
















/****************存放ik中的全局变量*****************/
float botom_angle = 135;         //底盘舵机控制量，范围0-270

float circle_angle = 135;         //手腕舵机控制量，范围45-225

motorSPEED motorspeed;

servoANGLE servoangle;












/****************存放servo中的全局变量*****************/


















/****************存放motor中的全局变量*****************/













/************存放flash和actiongroup中的全局变量*************/




/************存放line中的全局变量*************/
int tick_signal; 



















