
/*
******************************************************************************
本文件用于存放全局变量


******************************************************************************
*/


#include "main.h"
#include "global.h"



/****************存放main中的全局变量*****************/















/****************存放uart中的全局变量*****************/
uint8_t RxData[MAX];          //上位机原始数据帧存放处











/****************存放readdata中的全局变量*****************/
SPEED speed;          //解析数据帧得到的原始陀螺仪数据











/****************存放ik中的全局变量*****************/
motorSPEED motorspeed;          //计算后得到的电机相对转速，范围（-1000，1000）














/****************存放servo中的全局变量*****************/


















/****************存放motor中的全局变量*****************/














/****************存放buzzer和led中的全局变量*****************/
















