
/*
******************************************************************************
本文件用于存放全局变量


******************************************************************************
*/


#include "main.h"
#include "global.h"



/****************存放main中的全局变量*****************/















/****************存放uart中的全局变量*****************/
uint8_t RxData[MAX];          //上位机原始数据帧存放处

uint8_t value;     //上位机发来的字节
uint16_t volatile uart_index;    //读到位
uint8_t volatile ifrxstart;
uint8_t volatile rxcplt_flag = 0;      //数据读完标志位









/****************存放readdata中的全局变量*****************/
uint8_t ifgrab;      //是否抓取标志位，0为不抓取，1为抓取
uint8_t actionnum;        //动作组中的动作编号

MDATA speedData_primary;          //上位机发来的原始陀螺仪数据

SDATA servoData_primary;    //上位机发来的六个舵机原始控制量














/****************存放ik中的全局变量*****************/
motorSPEED motorspeed;          //计算后得到的电机相对转速，范围（-1000，1000）

servoANGLE servoangle;        //计算后得到的舵机控制量，范围-135-135

float botom_angle = 135;         //底盘舵机控制量，范围0-270

float circle_angle = 135;         //手腕舵机控制量，范围45-225













/****************存放servo中的全局变量*****************/


















/****************存放motor中的全局变量*****************/














/****************存放buzzer和led中的全局变量*****************/
















